### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [559]:
# Dependencies and Setup
import pandas as pd

In [560]:
# File to Load (Remember to Change These)
file= "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
gamer_df= pd.read_csv(file)

In [561]:
gamer_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [562]:
Players=gamer_df[["SN"]].value_counts()
Players

SN
Lisosia93       5
Iral74          4
Idastidru52     4
Aina42          3
Iri67           3
               ..
Lisossala30     1
Lisossanya98    1
Lisotesta51     1
Lisovynya38     1
Adairialis76    1
Length: 576, dtype: int64

In [563]:
Total_Players = pd.DataFrame({"Total Players":[576]})
Total_Players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [564]:
number_purchases =gamer_df["Purchase ID"].value_counts()
number_purchases

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [565]:
average_price= round(gamer_df["Price"].mean(),2)
average_price

3.05

In [566]:
total_revenue= gamer_df["Price"].sum()
total_revenue

2379.77

In [567]:
unique_items= gamer_df["Item Name"].value_counts()
unique_items

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Persuasion                                       9
Extraction, Quickblade Of Trembling Hands        9
Nirvana                                          9
                                                ..
Riddle, Tribute of Ended Dreams                  1
Alpha, Reach of Ending Hope                      1
Endbringer                                       1
The Decapitator                                  1
Celeste                                          1
Name: Item Name, Length: 179, dtype: int64

In [568]:
Purchasing_Analysis = pd.DataFrame({"Number of Unique Items":[179], "Average Price": ["$3.05"], "Number of Purchases":[780], "Total Revenue": ["$2,379.77"]})
Purchasing_Analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [569]:
#count of Genders
gender= gamer_df["Gender"].value_counts()
gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [570]:
#Total count of All genders
total = gender.sum()
total

780

In [571]:
#Summary of Gender Count and Percentage of players
gender_count_df =round(pd.DataFrame({"Total Count": gender,"Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]}),2)
gender_count_df

                       Total Count  Percentage of Players
Male                           652                  83.59
Female                         113                  14.49
Other / Non-Disclosed           15                   1.92

In [572]:
#Alternative way of showing the same data

Gender_Demo= round(pd.DataFrame({"":["Male","Female","Other/Non Disclosed"], 
                           "Total Count":[652, 113, 15],
                           "Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]
                          }),2)
Gender_Demo

                        Total Count  Percentage of Players
0                 Male          652                  83.59
1               Female          113                  14.49
2  Other/Non Disclosed           15                   1.92

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [573]:
purchasing_df= gamer_df[["Gender","Price"]]
purchasing_df.head()

  Gender  Price
0   Male   3.53
1   Male   1.56
2   Male   4.88
3   Male   3.27
4   Male   1.44

In [574]:
purchase_group= purchasing_df.groupby(["Gender"])
average_price_df= round(purchase_group.mean(),2)
average_price_df

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [575]:
total_price_df= purchase_group.sum()
total_price_df

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [576]:
Purchasing_Analysis_df=pd.DataFrame({"Gender":["Male","Female","Other/Non Disclosed"], 
                           "Purchase Count":[652, 113, 15],
                           "Average Purchase Price":[3.02,3.20,3.35],
                            "Total Purchase Value":["$1967.64","$361.94","$50.19"]
                          })
Purchasing_Analysis_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value
0,Male,652,3.02,$1967.64
1,Female,113,3.20,$361.94
2,Other/Non Disclosed,15,3.35,$50.19

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [577]:
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [578]:
#created Bins in which data will be held
bins =[0,9,14,19,24,29,34,39,50]

#names for bins

age_groups = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [579]:
gamer_df["Age Ranges"]=pd.cut(gamer_df["Age"],bins,labels=age_groups, include_lowest= True)
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [580]:
gamer_df[["Age Ranges","Age"]].head()

  Age Ranges  Age
0      20-24   20
1        40+   40
2      20-24   24
3      20-24   24
4      20-24   23

In [581]:
#Group by age ranges
age_ranges_df=gamer_df.groupby("Age Ranges")
age_ranges_df["Age"].count()

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [582]:
#Data Frame
Demographic_Summary_df=round(pd.DataFrame({"":["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"], 
                                     "Total Count":[23,28,136,365,101,73,41,13],
                                    "Percentage of Players":[(23/780)*100,(28/780)*100,(136/780)*100,(365/780)*100,(101/780)*100,(73/780)*100,(41/780)*100,(13/780)*100],
                                   }),2)
                        
Demographic_Summary_df

          Total Count  Percentage of Players
0    <10           23                   2.95
1  10-14           28                   3.59
2  15-19          136                  17.44
3  20-24          365                  46.79
4  25-29          101                  12.95
5  30-34           73                   9.36
6  35-39           41                   5.26
7    40+           13                   1.67

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [583]:
#created Bins in which data will be held
bins =[0,9,14,19,24,29,34,39,50]

#names for bins

ages_df = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [584]:
gamer_df["Age Ranges"]=pd.cut(gamer_df["Age"],bins,labels=age_groups, include_lowest= True)
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [585]:
money_df=gamer_df[["Age Ranges","Price"]]
money_df.head()

  Age Ranges  Price
0      20-24   3.53
1        40+   1.56
2      20-24   4.88
3      20-24   3.27
4      20-24   1.44

In [586]:
Follow_the_money_df= money_df.groupby(["Age Ranges"])
Follow_the_money_df.sum()

              Price
Age Ranges
<10           77.13
10-14         82.78
15-19        412.89
20-24       1114.06
25-29        293.00
30-34        214.00
35-39        147.67
40+           38.24

In [587]:
round(Follow_the_money_df.mean(),2)

            Price
Age Ranges
<10          3.35
10-14        2.96
15-19        3.04
20-24        3.05
25-29        2.90
30-34        2.93
35-39        3.60
40+          2.94

In [588]:
Money_Talks_df=pd.DataFrame({"Age Ranges":["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"], 
                           "Purchase Count":[23,28,136,365,101,73,41,13],
                           "Average Purchase Price":["$3.35","2.96","$3.04","$3.05","$2.90","$2.93","$3.60","$2.94"],
                            "Total Purchase Value":["$77.13","$82.78","$412.89","$1,114.06","$293.00","$214.00","$147.67", "$38.24"]
                          })
Money_Talks_df

  Age Ranges  Purchase Count Average Purchase Price Total Purchase Value
0        <10              23                  $3.35               $77.13
1      10-14              28                   2.96               $82.78
2      15-19             136                  $3.04              $412.89
3      20-24             365                  $3.05            $1,114.06
4      25-29             101                  $2.90              $293.00
5      30-34              73                  $2.93              $214.00
6      35-39              41                  $3.60              $147.67
7        40+              13                  $2.94               $38.24

In [ ]:
#Turns on custome formatting 
#pd.options.display.float_format = '${:,.2f}'.format

In [249]:
#This will turn off all float formatting
#pd.options.display.float_format= None

NoneType

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [589]:
#Uniqe SN name
name_df= gamer_df[["SN","Price","Item Name"]]
name_df.value_counts()

SN            Price  Item Name
Zontibe81     3.79   Arcane Gem                                   1
Frichjask31   4.43   Deluge, Edge of the West                     1
Haisrisuir60  4.19   Final Critic                                 1
              2.67   Abyssal Shard                                1
Haillyrgue51  4.60   Dawn                                         1
                                                                 ..
Marokian45    3.53   Extraction, Quickblade Of Trembling Hands    1
Marjask87     1.44   Suspension                                   1
Marirrasta50  4.66   Endbringer                                   1
Marim28       3.33   Lifebender                                   1
Adairialis76  2.28   Twilight's Carver                            1
Length: 780, dtype: int64

In [590]:
#creat dataframe of the average for each screen name
sn_group =name_df.groupby(["SN"])

cost_breakdown_df= round(sn_group.mean(),2)
cost_breakdown_df

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      2.07
Yathedeu43      3.01
Yoishirrala98   4.58
Zhisrisu83      3.94
Zontibe81       2.68

[576 rows x 1 columns]

In [591]:
cost_breakdown_df=sn_group.sum()
cost_breakdown_df

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [592]:
cost_breakdown_df=sn_group.count()
cost_breakdown_df

               Price  Item Name
SN
Adairialis76       1          1
Adastirin33        1          1
Aeda94             1          1
Aela59             1          1
Aelaria33          1          1
...              ...        ...
Yathecal82         3          3
Yathedeu43         2          2
Yoishirrala98      1          1
Zhisrisu83         2          2
Zontibe81          3          3

[576 rows x 2 columns]

In [593]:
sort_df = cost_breakdown_df.sort_values("Price",ascending=False )
sort_df.head()

             Price  Item Name
SN
Lisosia93        5          5
Iral74           4          4
Idastidru52      4          4
Asur53           3          3
Inguron55        3          3

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [594]:
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [595]:
#Most Popular Items
ID= gamer_df[["Item ID","Item Name"]].value_counts()
ID.head(20)

Item ID  Item Name
92       Final Critic                                    13
178      Oathbreaker, Last Hope of the Breaking Storm    12
108      Extraction, Quickblade Of Trembling Hands        9
132      Persuasion                                       9
82       Nirvana                                          9
145      Fiery Glass Crusader                             9
60       Wolf                                             8
34       Retribution Axe                                  8
37       Shadow Strike, Glory of Ending Hope              8
59       Lightning, Etcher of the King                    8
72       Winter's Bite                                    8
19       Pursuit, Cudgel of Necromancy                    8
103      Singed Scalpel                                   8
75       Brutality Ivory Warmace                          8
117      Heartstriker, Legacy of the Light                7
164      Exiled Doomblade                                 7
78       Glimmer, Ender of the Moon                       7
159      Oathbreaker, Spellblade of Trials                7
71       Demise                                           7
85       Malificent Bag                                   7
dtype: int64

In [621]:
#Total count of Item ID and Name with price 
ID_Price= gamer_df[["Item ID","Item Name","Price"]]
ID_Price.value_counts().head(20)

Item ID  Item Name                                     Price
178      Oathbreaker, Last Hope of the Breaking Storm  4.23     12
145      Fiery Glass Crusader                          4.58      9
82       Nirvana                                       4.90      9
108      Extraction, Quickblade Of Trembling Hands     3.53      9
34       Retribution Axe                               2.22      8
75       Brutality Ivory Warmace                       2.42      8
92       Final Critic                                  4.88      8
72       Winter's Bite                                 3.77      8
19       Pursuit, Cudgel of Necromancy                 1.02      8
60       Wolf                                          3.54      8
103      Singed Scalpel                                4.35      8
37       Shadow Strike, Glory of Ending Hope           3.16      8
59       Lightning, Etcher of the King                 4.23      8
159      Oathbreaker, Spellblade of Trials             3.08      7
85       Malificent Bag                                1.75      7
78       Glimmer, Ender of the Moon                    4.40      7
132      Persuasion                                    3.19      7
71       Demise                                        1.61      7
7        Thorn, Satchel of Dark Souls                  1.33      7
110      Suspension                                    1.44      7
dtype: int64

In [626]:
ID_Price.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [628]:
#Item price
item_group=ID_Price.groupby(["Item ID","Item Name"])
item_mean=round(item_group.mean(),2)
item_mean.head()

                            Price
Item ID Item Name
0       Splinter             1.28
1       Crucifer             2.94
2       Verdict              2.48
3       Phantomlight         2.49
4       Bloodlord's Fetish   1.70

In [633]:
#Item Sum price
item_sum=item_group.sum()
item_sum

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [680]:
counts_of_items= gamer_df["Item ID"].value_counts()
ID_Price["Count"]=counts_of_items

gamer_df.head()

<ipython-input-680-9f3a85ab5c70>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ID_Price["Count"]=counts_of_items

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges,Count
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,NaN
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,2.0
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,1.0
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,NaN
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,4.0

In [681]:
Sort_Count=ID_Price.sort_values("Count",ascending=False)
Sort_Count.head()

     Item ID                             Item Name  Price  Count
92        39  Betrayal, Whisper of Grieving Widows   3.94   13.0
178       57       Despair, Favor of Due Diligence   4.60   12.0
145       46               Hopeless Ebon Dualblade   1.33    9.0
132      145                  Fiery Glass Crusader   4.58    9.0
108       85                        Malificent Bag   1.75    9.0

In [601]:
most_popular=pd.DataFrame({"Item ID":[92,178,145,132,108],
                          "Item Name":["Final Critic","Oathbreaker Last Hope of the Breaking Storm","Fiery Glass Crusader","Nirvana","Extraction Quickblade Of Trembling Hands"],
                          "Item ID":[13,12,9,9,9],
                           "Item Price":["$4.61","$4.23","$4.58","$3.22","$3.53"],
                          "Total Purchase Value":[(13*4.61),(12*4.23),(9*4.58),(9*3.22),(9*3.53)]})
most_popular

,Item ID,Item Name,Item Price,Total Purchase Value
0,13,Final Critic,$4.61,59.93
1,12,Oathbreaker Last Hope of the Breaking Storm,$4.23,50.76
2,9,Fiery Glass Crusader,$4.58,41.22
3,9,Nirvana,$3.22,28.98
4,9,Extraction Quickblade Of Trembling Hands,$3.53,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80